Ran Plan for 2 projects:

1. project: `cvm` dir: `cvm` workspace: `default`
1. project: `clb` dir: `clb` workspace: `default`
---

### 1. project: `cvm` dir: `cvm` workspace: `default`
<details><summary>Show Output</summary>

```diff
Fetching temporary credentials...
Token=WmscDR409iAXGy8Hex7HdRAIh9O2rbOadb4694ef67a4d192a8969da75c8502d0_NpVH8YZIP6wD8AQyEr21cD3axgRTcvVMRhdsO6WnaaHwI2QfuCM5TIvtTKuffhhwbkBVo72ID0g0pJ-DF5EzohZ7nSBa862rsQceNE1008Se37HA0M-bbtoQL5L1PD0Gwc6QaXnAUSVsQCc4N6_R2MQ29Jd45xuADiCRap01ozuYyM0xCgLMXLobDpifssW3rWIH0G5WfFs7rpSkRK4ZbYeqnoqJVaP62PTmgI3WaCoIgi4rQ9W3xSk5azxpRniN_OKtW6T0zAwb2Clw6FaF1U1JXusApa3ZlRK56FvVtpjNeeAsSqQQBTtAmFPYtbeORCMH1_FyP4UHdllLLcaG5E83lpPZD25EG_7F3dnIA4E1VkTlLuzUtJKjeCHi9R9KyvAOm0ibqmTGcH8ux3dGHLEDFbg7K2T1n77yYHIr0E
TmpSecretId=AKID1XKY2bqTOKwCMM56ngaVjnMqq9qzWQUUnWZ8mrI4yohI0m_IT5a8vvIqi8QEwsaw
TmpSecretKey=D8g4uX85EPsabRTAhfkuDiOxof29/PL5IRSQ+dUA7qI=
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKID1XKY2bqTOKwCMM56ngaVjnMqq9qzWQUUnWZ8mrI4yohI0m_IT5a8vvIqi8QEwsaw
TENCENTCLOUD_SECRET_KEY=D8g4uX85EPsabRTAhfkuDiOxof29/PL5IRSQ+dUA7qI=
TENCENTCLOUD_SECURITY_TOKEN=WmscDR409iAXGy8Hex7HdRAIh9O2rbOadb4694ef67a4d192a8969da75c8502d0_NpVH8YZIP6wD8AQyEr21cD3axgRTcvVMRhdsO6WnaaHwI2QfuCM5TIvtTKuffhhwbkBVo72ID0g0pJ-DF5EzohZ7nSBa862rsQceNE1008Se37HA0M-bbtoQL5L1PD0Gwc6QaXnAUSVsQCc4N6_R2MQ29Jd45xuADiCRap01ozuYyM0xCgLMXLobDpifssW3rWIH0G5WfFs7rpSkRK4ZbYeqnoqJVaP62PTmgI3WaCoIgi4rQ9W3xSk5azxpRniN_OKtW6T0zAwb2Clw6FaF1U1JXusApa3ZlRK56FvVtpjNeeAsSqQQBTtAmFPYtbeORCMH1_FyP4UHdllLLcaG5E83lpPZD25EG_7F3dnIA4E1VkTlLuzUtJKjeCHi9R9KyvAOm0ibqmTGcH8ux3dGHLEDFbg7K2T1n77yYHIr0E
Initializing the backend...
Initializing provider plugins...
- Finding latest version of tencentcloudstack/tencentcloud...
- Installing tencentcloudstack/tencentcloud v1.81.111...
- Installed tencentcloudstack/tencentcloud v1.81.111 (signed by a HashiCorp partner, key ID 84F69E1C1BECF459)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Fetching temporary credentials...
Token=WmscDR409iAXGy8Hex7HdRAIh9O2rbOaa0e56e3a17c6171314ab7addd2349793_NpVH8YZIP6wD8AQyEr21SSh0TeNI-xG-VTBsUxEITHnQ01wmmgALU-Zxtsra9p2P0Db4dB-4_bqVRlqSBvbTFEjuX16ssXHan9jzNPbys43oF2hrIwuPJejce6AQVAZO_473QBzmr0rTXmgTpeWE46KKbuwZnYsCpuMB93SDuOJqMVJWHRCGy9TjPjcOWoQD1ZEFFeMl_8Trse-oAWkPk0DVXfC-rF5J_mgtgI7L1yA2M8WKkH0XN6hotUUonrYCtgG8zrTxItYO4yVxhw2Yjy9Mfx13hFUqbjB6BxC46Rb7SCRX2x0t7vslFgM_maLS-P5J2CFvTqex9BCk0M-wcJenRlNR2BT5UiCpQKjF0KghNwI7_qtye2ds9Y_F7SVT3Dm4xCAPuW2lw2JNubizdiMi0zBY6Fj9qCP6IU03C0
TmpSecretId=AKIDeI2EauSx4IBa4SqhGjlmYAA6uQBKxgWOkXHqfGWdkvxrLP229TabHdqTOZNsJbWI
TmpSecretKey=DWs8cbtdafFrLKtahtgWyQl9nBBIZsfCJ+TNA2G/NcU=
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDeI2EauSx4IBa4SqhGjlmYAA6uQBKxgWOkXHqfGWdkvxrLP229TabHdqTOZNsJbWI
TENCENTCLOUD_SECRET_KEY=DWs8cbtdafFrLKtahtgWyQl9nBBIZsfCJ+TNA2G/NcU=
TENCENTCLOUD_SECURITY_TOKEN=WmscDR409iAXGy8Hex7HdRAIh9O2rbOaa0e56e3a17c6171314ab7addd2349793_NpVH8YZIP6wD8AQyEr21SSh0TeNI-xG-VTBsUxEITHnQ01wmmgALU-Zxtsra9p2P0Db4dB-4_bqVRlqSBvbTFEjuX16ssXHan9jzNPbys43oF2hrIwuPJejce6AQVAZO_473QBzmr0rTXmgTpeWE46KKbuwZnYsCpuMB93SDuOJqMVJWHRCGy9TjPjcOWoQD1ZEFFeMl_8Trse-oAWkPk0DVXfC-rF5J_mgtgI7L1yA2M8WKkH0XN6hotUUonrYCtgG8zrTxItYO4yVxhw2Yjy9Mfx13hFUqbjB6BxC46Rb7SCRX2x0t7vslFgM_maLS-P5J2CFvTqex9BCk0M-wcJenRlNR2BT5UiCpQKjF0KghNwI7_qtye2ds9Y_F7SVT3Dm4xCAPuW2lw2JNubizdiMi0zBY6Fj9qCP6IU03C0

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_instance.cvm_cicd_kk_1 will be created
  + resource "tencentcloud_instance" "cvm_cicd_kk_1" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + hostname                                = "user"
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cvm_cicd_kk_1"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = (known after apply)
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)

      + data_disks {
          + data_disk_id           = (known after apply)
          + data_disk_size         = 50
          + data_disk_type         = "CLOUD_PREMIUM"
          + delete_with_instance   = true
          + encrypt                = false
          + throughput_performance = 0
        }
    }

  # tencentcloud_subnet.cicd_kk will be created
  + resource "tencentcloud_subnet" "cicd_kk" {
      + availability_zone  = "ap-jakarta-2"
      + available_ip_count = (known after apply)
      + cidr_block         = "10.0.1.0/24"
      + create_time        = (known after apply)
      + id                 = (known after apply)
      + is_default         = (known after apply)
      + is_multicast       = false
      + name               = "cicd_kk_subnet"
      + route_table_id     = (known after apply)
      + vpc_id             = (known after apply)
    }

  # tencentcloud_vpc.cicd_kk will be created
  + resource "tencentcloud_vpc" "cicd_kk" {
      + assistant_cidrs        = (known after apply)
      + cidr_block             = "10.0.0.0/16"
      + create_time            = (known after apply)
      + default_route_table_id = (known after apply)
      + dns_servers            = (known after apply)
      + docker_assistant_cidrs = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + is_multicast           = false
      + name                   = "cicd_kk_vpc"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + instance_id = (known after apply)
  + public_ip   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p cvm
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://43.133.145.82:4141/events/lock?id=yakir-Yang%252Fterraform-demo-with-cam-sts%252Fcvm%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p cvm
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. project: `clb` dir: `clb` workspace: `default`
<details><summary>Show Output</summary>

```diff
Fetching temporary credentials...
Token=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa9fda8cd82daa705af2b068baaf96cb2a_NpVH8YZIP6wD8AQyEr21QEYus1W0WndreylrkWurXiW5lhL_cRpRik5ZSmbiqGRRcpl-SJ8thYb8VNxwXh9y-wOBNMctyXop5bOBhv4ZDHWVwB_Gbh7oTAXY1hHiAqY7Fh8uguuDI2dg87xz409EuVr2uPM6Pw1VPfeYCLvUNHHu0zEJRtk8rNZPl9OXnjC32wUKJfOed3woNVQREwDlsjeII1-JhMjqBEfkCEIH6enbcl9SWVKd_oTXrg4VvwquXRr6lFO_IdDikn0gbsxDHMtadhcyrmf9vS_rQGdBoGmuqH5LxY0PcSW9mJ9tnFLG38iC0pGcRkJYoiI6Y6RPRgC5mNTelz-xX-EuXJ60anw3xdUiQ2qtauMTaMHfInZAWQqsNjV2qhry77UpkJgQuPvKaalh-JgHDjb3jvSMsA
TmpSecretId=AKIDFFHWQoVkgtx-ShKvA8W_eFzYafExPGIhlf-w9pAWVhWJAJh45msewgjXMYeuUI_g
TmpSecretKey=X/IpcZSQV4eHRc/fr5hFkElJthtckwdb+JdDfvG5xt0=
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDFFHWQoVkgtx-ShKvA8W_eFzYafExPGIhlf-w9pAWVhWJAJh45msewgjXMYeuUI_g
TENCENTCLOUD_SECRET_KEY=X/IpcZSQV4eHRc/fr5hFkElJthtckwdb+JdDfvG5xt0=
TENCENTCLOUD_SECURITY_TOKEN=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa9fda8cd82daa705af2b068baaf96cb2a_NpVH8YZIP6wD8AQyEr21QEYus1W0WndreylrkWurXiW5lhL_cRpRik5ZSmbiqGRRcpl-SJ8thYb8VNxwXh9y-wOBNMctyXop5bOBhv4ZDHWVwB_Gbh7oTAXY1hHiAqY7Fh8uguuDI2dg87xz409EuVr2uPM6Pw1VPfeYCLvUNHHu0zEJRtk8rNZPl9OXnjC32wUKJfOed3woNVQREwDlsjeII1-JhMjqBEfkCEIH6enbcl9SWVKd_oTXrg4VvwquXRr6lFO_IdDikn0gbsxDHMtadhcyrmf9vS_rQGdBoGmuqH5LxY0PcSW9mJ9tnFLG38iC0pGcRkJYoiI6Y6RPRgC5mNTelz-xX-EuXJ60anw3xdUiQ2qtauMTaMHfInZAWQqsNjV2qhry77UpkJgQuPvKaalh-JgHDjb3jvSMsA
Initializing the backend...
Initializing provider plugins...
- Finding latest version of tencentcloudstack/tencentcloud...
- Installing tencentcloudstack/tencentcloud v1.81.111...
- Installed tencentcloudstack/tencentcloud v1.81.111 (signed by a HashiCorp partner, key ID 84F69E1C1BECF459)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Fetching temporary credentials...
Token=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa28fc4725f0d7d02948bb54f59370279e_NpVH8YZIP6wD8AQyEr21YH0CeIumBhQ0Sk04DH1iP_h5qF8KEFzKJqr3ERHgrLJHbjdCZB-k6NOYkqYNpoZYDhBZj6tnKHBkYapjY6aFjVmR_myL0fT7BN8O3hKm3VfMDPKFMB2TgfxuQ3prKaXyX8nsnZtk41cgnMHcWiWhUJcGavCFFhRLGSsq2ddOjbGpbFV5V7zNJlyUVdHStq474nyASSBzgpVGzzDnwI8dz2s3JagCECaj6V682V4RpYcMbfrUE0BscQZP10wLuXhkekSnN3syYkGVo42NHDLFwEULbU5YmCN6wcRZbZvaddNbm35u3D7ECzLqau7n7wMJzlipCoEUNbu9HiE2YDL5Tg4SOA8jqHyUq9-UZlSuwMQ-ykJYxx_0ivJnbJlr1VETn44-hflQsWi0eKVvvG6DY8
TmpSecretId=AKIDARMgYVh1R2PH5RQ5NSzIi9zvP8a1hZiv4B8KirUsq6uenmy8RaNNuvQLF5j66Jmb
TmpSecretKey=Yldkxh2+pU6pJyoBGLgFxo+fOD7o7fdnL9gB72gWzNU=
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDARMgYVh1R2PH5RQ5NSzIi9zvP8a1hZiv4B8KirUsq6uenmy8RaNNuvQLF5j66Jmb
TENCENTCLOUD_SECRET_KEY=Yldkxh2+pU6pJyoBGLgFxo+fOD7o7fdnL9gB72gWzNU=
TENCENTCLOUD_SECURITY_TOKEN=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa28fc4725f0d7d02948bb54f59370279e_NpVH8YZIP6wD8AQyEr21YH0CeIumBhQ0Sk04DH1iP_h5qF8KEFzKJqr3ERHgrLJHbjdCZB-k6NOYkqYNpoZYDhBZj6tnKHBkYapjY6aFjVmR_myL0fT7BN8O3hKm3VfMDPKFMB2TgfxuQ3prKaXyX8nsnZtk41cgnMHcWiWhUJcGavCFFhRLGSsq2ddOjbGpbFV5V7zNJlyUVdHStq474nyASSBzgpVGzzDnwI8dz2s3JagCECaj6V682V4RpYcMbfrUE0BscQZP10wLuXhkekSnN3syYkGVo42NHDLFwEULbU5YmCN6wcRZbZvaddNbm35u3D7ECzLqau7n7wMJzlipCoEUNbu9HiE2YDL5Tg4SOA8jqHyUq9-UZlSuwMQ-ykJYxx_0ivJnbJlr1VETn44-hflQsWi0eKVvvG6DY8

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_clb_attachment.attachment_tcp will be created
  + resource "tencentcloud_clb_attachment" "attachment_tcp" {
      + clb_id        = (known after apply)
      + id            = (known after apply)
      + listener_id   = (known after apply)
      + protocol_type = (known after apply)

      + targets {
          + instance_id = (known after apply)
          + port        = 8080
          + weight      = 10
            # (1 unchanged attribute hidden)
        }
      + targets {
          + instance_id = (known after apply)
          + port        = 8080
          + weight      = 10
            # (1 unchanged attribute hidden)
        }
    }

  # tencentcloud_clb_instance.cicd_foo will be created
  + resource "tencentcloud_clb_instance" "cicd_foo" {
      + address_ip_version           = (known after apply)
      + address_ipv6                 = (known after apply)
      + clb_name                     = "cicd_foo_clb"
      + clb_vips                     = (known after apply)
      + domain                       = (known after apply)
      + id                           = (known after apply)
      + internet_bandwidth_max_out   = (known after apply)
      + internet_charge_type         = (known after apply)
      + ipv6_mode                    = (known after apply)
      + load_balancer_pass_to_target = false
      + master_zone_id               = (known after apply)
      + network_type                 = "OPEN"
      + project_id                   = 0
      + security_groups              = (known after apply)
      + sla_type                     = (known after apply)
      + slave_zone_id                = (known after apply)
      + target_region_info_region    = (known after apply)
      + target_region_info_vpc_id    = (known after apply)
      + vip                          = (known after apply)
      + vip_isp                      = (known after apply)
      + vpc_id                       = (known after apply)
      + zone_id                      = (known after apply)
    }

  # tencentcloud_clb_listener.listener_http_dst will be created
  + resource "tencentcloud_clb_listener" "listener_http_dst" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_http_dst"
      + port                       = 81
      + protocol                   = "HTTP"
      + scheduler                  = "WRR"
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener.listener_http_src will be created
  + resource "tencentcloud_clb_listener" "listener_http_src" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_http_src"
      + port                       = 80
      + protocol                   = "HTTP"
      + scheduler                  = "WRR"
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener.listener_tcp will be created
  + resource "tencentcloud_clb_listener" "listener_tcp" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = 2
      + health_check_http_code     = 2
      + health_check_http_method   = "GET"
      + health_check_http_version  = "HTTP/1.0"
      + health_check_interval_time = 100
      + health_check_port          = 200
      + health_check_switch        = true
      + health_check_time_out      = 30
      + health_check_type          = "HTTP"
      + health_check_unhealth_num  = 2
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_tcp"
      + port                       = 8080
      + protocol                   = "TCP"
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener_rule.rule_http_dst will be created
  + resource "tencentcloud_clb_listener_rule" "rule_http_dst" {
      + clb_id                     = (known after apply)
      + domain                     = "abcd.com"
      + forward_type               = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_code     = (known after apply)
      + health_check_http_domain   = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_http_path     = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + http2_switch               = (known after apply)
      + id                         = (known after apply)
      + listener_id                = (known after apply)
      + quic                       = (known after apply)
      + rule_id                    = (known after apply)
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + target_type                = "NODE"
      + url                        = "/"
    }

  # tencentcloud_clb_listener_rule.rule_http_src will be created
  + resource "tencentcloud_clb_listener_rule" "rule_http_src" {
      + clb_id                     = (known after apply)
      + domain                     = "abc.com"
      + forward_type               = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_code     = (known after apply)
      + health_check_http_domain   = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_http_path     = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + http2_switch               = (known after apply)
      + id                         = (known after apply)
      + listener_id                = (known after apply)
      + quic                       = (known after apply)
      + rule_id                    = (known after apply)
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + target_type                = "NODE"
      + url                        = "/"
    }

  # tencentcloud_clb_redirection.redirection_http will be created
  + resource "tencentcloud_clb_redirection" "redirection_http" {
      + clb_id                  = (known after apply)
      + delete_all_auto_rewrite = false
      + id                      = (known after apply)
      + source_listener_id      = (known after apply)
      + source_rule_id          = (known after apply)
      + target_listener_id      = (known after apply)
      + target_rule_id          = (known after apply)
    }

  # tencentcloud_instance.cicd_foo_1 will be created
  + resource "tencentcloud_instance" "cicd_foo_1" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cicd_foo_cvm1"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = 0
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)

      + data_disks (known after apply)
    }

  # tencentcloud_instance.cicd_foo_2 will be created
  + resource "tencentcloud_instance" "cicd_foo_2" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cicd_foo_cvm2"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = 0
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)

      + data_disks (known after apply)
    }

  # tencentcloud_security_group.cicd_foo will be created
  + resource "tencentcloud_security_group" "cicd_foo" {
      + id         = (known after apply)
      + name       = "cicd-foo-sg"
      + project_id = (known after apply)
    }

  # tencentcloud_subnet.cicd_foo will be created
  + resource "tencentcloud_subnet" "cicd_foo" {
      + availability_zone  = "ap-jakarta-2"
      + available_ip_count = (known after apply)
      + cidr_block         = "10.0.0.0/16"
      + create_time        = (known after apply)
      + id                 = (known after apply)
      + is_default         = (known after apply)
      + is_multicast       = false
      + name               = "cicd-foo-subnet"
      + route_table_id     = (known after apply)
      + vpc_id             = (known after apply)
    }

  # tencentcloud_vpc.cicd_foo will be created
  + resource "tencentcloud_vpc" "cicd_foo" {
      + assistant_cidrs        = (known after apply)
      + cidr_block             = "10.0.0.0/16"
      + create_time            = (known after apply)
      + default_route_table_id = (known after apply)
      + dns_servers            = (known after apply)
      + docker_assistant_cidrs = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + is_multicast           = false
      + name                   = "cicd-foo-vpc"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + clb_instance_id  = (known after apply)
  + cvm1_instance_id = (known after apply)
  + cvm2_instance_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p clb
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://43.133.145.82:4141/events/lock?id=yakir-Yang%252Fterraform-demo-with-cam-sts%252Fclb%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p clb
  ```
Plan: 13 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```